Revit 2024 API
CircuitNamingSchemeSettings.CircuitNamingSchemeId Property
 The circuit naming scheme id set in CircuitNamingSchemeSettings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ElementId CircuitNamingSchemeId { get; set; }
Visual Basic
Public Property CircuitNamingSchemeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ CircuitNamingSchemeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The circuit naming scheme id is invalid for the CircuitNamingSchemeSettings.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace